app/controllers/wines_controller.rb

  def show
    @wine = Wine.find(params[:id])
---
SELECT  "wines".* FROM "wines" WHERE "wines"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @wine = Wine.new
    @wine.user_id = params[:user_id]
    @wine.price = params[:price]
    @wine.store = params[:store]
    @wine.description = params[:description]
    @wine.rating = params[:rating]
    @wine.style_grape = params[:style_grape]
    @wine.brand = params[:brand]
    @wine.label = params[:label]

    if @wine.save
---
INSERT INTO "wines" ("user_id", "price", "store", "description", "rating", "style_grape", "brand", "label", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    @wine = Wine.find(params[:id])
---
SELECT  "wines".* FROM "wines" WHERE "wines"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @wine = Wine.find(params[:id])

    @wine.user_id = params[:user_id]
    @wine.price = params[:price]
    @wine.store = params[:store]
    @wine.description = params[:description]
    @wine.rating = params[:rating]
    @wine.style_grape = params[:style_grape]
    @wine.brand = params[:brand]
    @wine.label = params [:label]

    if @wine.save
---
SELECT  "wines".* FROM "wines" WHERE "wines"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "wines" SET "style_grape" = ?, "updated_at" = ? WHERE "wines"."id" = ?  [["style_grape", "Pink"], ["updated_at", "2016-06-11 01:45:03.116666"], ["id", 1]]

  def destroy
    @wine = Wine.find(params[:id])

    @wine.destroy
---
SELECT  "wines".* FROM "wines" WHERE "wines"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "wines" WHERE "wines"."id" = ?  [["id", 1]]